app/Filament/Resources/BranchResource.php

select `branches`.`id` from `branches` inner join `user_branches` on `branches`.`id` = `user_branches`.`branch_id` where `user_branches`.`user_id` = 1
select `regions`.`id` from `regions` inner join `user_regions` on `regions`.`id` = `user_regions`.`region_id` where `user_regions`.`user_id` = 1
select `countries`.`id` from `countries` inner join `user_countries` on `countries`.`id` = `user_countries`.`country_id` where `user_countries`.`user_id` = 1
---
    protected static function applyUserRegionBranchFilter(Builder $query): Builder
    {
        $user = Auth::user();

        // If no authenticated user, return an empty result set
        if (!$user) {
            return $query->whereRaw('1 = 0');
        }

        // Ensure the query builder is using the correct model
        if (!$query->getModel()) {
            $query = Branch::query();
        }

        // Cache user-related data to minimize redundant queries
        $branchIds = cache()->remember("user:{$user->id}:branches", now()->addMinutes(5), function () use ($user) {
            return $user->branches()->pluck('branches.id')->toArray();
        });

        $regionIds = cache()->remember("user:{$user->id}:regions", now()->addMinutes(5), function () use ($user) {
            return $user->regions()->pluck('regions.id')->toArray();
        });

        $countryIds = cache()->remember("user:{$user->id}:countries", now()->addMinutes(5), function () use ($user) {
            return $user->countries()->pluck('countries.id')->toArray();
        });