app/Filament/Resources/ComputerResource.php

select `branches`.`id` from `branches` inner join `user_branches` on `branches`.`id` = `user_branches`.`branch_id` where `user_branches`.`user_id` = 1
select `regions`.`id` from `regions` inner join `user_regions` on `regions`.`id` = `user_regions`.`region_id` where `user_regions`.`user_id` = 1
select `countries`.`id` from `countries` inner join `user_countries` on `countries`.`id` = `user_countries`.`country_id` where `user_countries`.`user_id` = 1
---
    public static function getEloquentQuery(): Builder
    {
        $user = Auth::user();

        if (!$user) {
            return parent::getEloquentQuery()->whereRaw('1 = 0'); // No authenticated user
        }

        // Retrieve IDs of branches, regions, and countries associated with the user
        $branchIds = $user->branches()->pluck('branches.id')->toArray();
        $regionIds = $user->regions()->pluck('regions.id')->toArray();
        $countryIds = $user->countries()->pluck('countries.id')->toArray();

select `countries`.`id` from `countries` inner join `user_countries` on `countries`.`id` = `user_countries`.`country_id` where `user_countries`.`user_id` = 1
select `regions`.`id` from `regions` inner join `user_regions` on `regions`.`id` = `user_regions`.`region_id` where `user_regions`.`user_id` = 1
select `branches`.`id` from `branches` inner join `user_branches` on `branches`.`id` = `user_branches`.`branch_id` where `user_branches`.`user_id` = 1
select `name`, `id` from `branches` where (`region_id` in (1, 2))
---
    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                // Branch and Basic Information Section
                Forms\Components\Section::make('Basic Information')
                    //->description('Provide the primary details of the computer.')
                    ->schema([
                        Forms\Components\Grid::make(2)  // Two-column layout
                            ->schema([
                                Select::make('branch_id')
                                    ->label('Branch')
                                    ->options(function () {
                                        $user = Auth::user();
                                        // Fetch user branches, regions, and countries
                                        $branchIds = $user->branches()->pluck('branches.id')->toArray();
                                        $regionIds = $user->regions()->pluck('regions.id')->toArray();
                                        $countryIds = $user->countries()->pluck('countries.id')->toArray();

                                        // Fetch branches the user has access to
                                        return Branch::query()
                                            ->where(function ($query) use ($branchIds, $regionIds, $countryIds) {
                                                if (!empty($branchIds)) {
                                                    $query->orWhereIn('id', $branchIds);
                                                }
                                                if (!empty($regionIds)) {
                                                    $query->orWhereIn('region_id', $regionIds);
                                                }
                                                if (!empty($countryIds)) {
                                                    $query->orWhereIn('country_id', $countryIds);
                                                }
                                            })
                                            ->pluck('name', 'id');

select * from `cpus`
---
                                            ]),
                                    ]),
                            ]),
                        Forms\Components\Grid::make(2)
                            ->schema([
                                Select::make('cpu_id')
                                    ->label('CPU')
                                    ->options(function () {
                                        return Cpu::all()->mapWithKeys(function ($cpu) {
                                            $label = "{$cpu->company} {$cpu->name} - {$cpu->core} cores, {$cpu->speed}, Gen {$cpu->gen}";
                                            return [$cpu->id => $label];
                                        });
                                    })
                                    ->getSearchResultsUsing(function (string $search) {
                                        return Cpu::where('name', 'like', "%{$search}%")
                                            ->orWhere('company', 'like', "%{$search}%")
                                            ->orWhere('core', 'like', "%{$search}%")
                                            ->orWhere('speed', 'like', "%{$search}%")
                                            ->orWhere('gen', 'like', "%{$search}%")
                                            ->get()
                                            ->mapWithKeys(function ($cpu) {
                                                $label = "{$cpu->company} {$cpu->name} - {$cpu->core} cores, {$cpu->speed}, Gen {$cpu->gen}";
                                                return [$cpu->id => $label];
                                            });

select * from `licenses`
select * from `software` where `software`.`id` in (1, 2, 4)
---
                    ->collapsed(),

                // Software Installations Section
                Forms\Components\Section::make('Software Installations')
                    ->description('Assign software licenses to this computer.')
                    ->schema([
                        Forms\Components\Repeater::make('installations')
                            ->relationship('installations')  // Define the relationship to the Installation model
                            ->schema([
                                Select::make('license_id')
                                    ->label('Software License')
                                    ->options(function () {
                                        return \App\Models\License::with('software')
                                            ->get()
                                            ->mapWithKeys(function ($license) {
                                                return [
                                                    $license->id => optional($license->software)->name . ' - ' . $license->license_type,
                                                ];
                                            });
                                    })
                                    ->required()
                                    ->searchable(),
                                TextInput::make('key')->label('License Key')->nullable(),
                                TextInput::make('userid')->label('User ID')->nullable(),