app/Filament/Resources/InstallationResource.php

select `name`, `id` from `branches`
---
                        Forms\Components\Select::make('branch_id')
                            ->label('Branch')
                            ->options(function () {
                                return \App\Models\Branch::pluck('name', 'id');  // Fetch branches from Branch model